results/580_driver_bios_update/officail_vllm_FP8c20.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             20        
Benchmark duration (s):                  128.53    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.23      
Output token throughput (tok/s):         59.75     
Peak output token throughput (tok/s):    220.00    
Peak concurrent requests:                23.00     
Total token throughput (tok/s):          821.65    
---------------Time to First Token----------------
Mean TTFT (ms):                          18070.67  
Median TTFT (ms):                        10825.94  
P99 TTFT (ms):                           47906.35  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          231.31    
Median TPOT (ms):                        264.45    
P99 TPOT (ms):                           296.30    
---------------Inter-token Latency----------------
Mean ITL (ms):                           230.50    
Median ITL (ms):                         104.62    
P99 ITL (ms):                            2073.29   
==================================================